{
  "HomePage": {
    "title": "Welcome to the Home Page",
    "greeting": "Hello, there!",
    "description": "I'm a software engineer with a passion for building scalable and efficient systems. I'm currently working as a software engineer at Google."
  },
  "Navigation": {
    "about": "About",
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact",
    "switchLanguage": "Switch language",
    "scrollToTop": "Scroll to top",
    "toggleTheme": "Toggle Theme"
  },
  "CV": "Download CV",
  "Confidential": {
    "description": "All rights reserved"
  },
  "MobileMenu": {
    "close": "Close menu",
    "open": "Open menu"
  },
  "AnimatedRoles": [
    "Programmer",
    "Web Developer",
    "Mobile Developer",
    "Programmer-Analyst",
    "IT Technician"
  ],
  "Description": {
    "short": "I'm a passionate software developer creating innovative, user-centric applications for web, mobile, and desktop platforms, blending technical expertise with creative design.",
    "details": "I'm a recent graduate from La Cité Collégiale's Computer Programming program (2023-2025), specializing in full-stack development for web, mobile, and desktop applications. I thrive on building seamless, efficient, and modern solutions that enhance user experiences."
  },
  "ViewMyProjects": "View My Projects",
  "ContactMe": {
    "title": "Contact Me",
    "description": "Please contact me directly at arthur.kamenitchualeu@gmail.com or through this form.",
    "name": "Your Name",
    "email": "Your Email",
    "message": "Your Message",
    "send": "Submit",
    "success": "Email sent successfully!",
    "error": "Email sent failed!"
  },
  "Projects": {
    "title": "I've been building a <lot>lot of things</lot>",
    "description": "Come explore the fruits of my labor, from small experiments to full-blown web, mobile and desktop applications, each project showcases my love for coding and design.",
    "universityLmsDesc": "A library management system for a university that allows students to borrow and return books, and for librarians to manage the library.",
    "coopBotDesc": "A bot that allows students to obtain information about the coop mode in College La Cité.",
    "desktopLmsDesc": "A desktop application for managing a library: managing books, members, loans/returns, and generating reports."
  },
  "RecentProjects": "Recent Projects",
  "AboutMe": "About Me",
  "SendDirectEmail": "Please contact me directly at <email>arthur.kamenitchualeu@gmail.com</email> or through this form.",
  "About": {
    "title": "Hey! I'm <name>Arthur Kameni</name> and I'm a software developer.",
    "description": {
      "first": "My name is Arthur Kameni, a dedicated developer who graduated from the Computer Programming program at La Cité Collégiale in Ottawa on April 20, 2025. Driven by patience and perseverance, I thrive on crafting clean, engaging, and user-friendly web interfaces that blend aesthetics with functionality. I live by the belief that \"once the solution to a problem is found, it becomes obvious.\" This mindset fuels my passion for turning complex challenges into intuitive solutions, whether for web, mobile, or desktop applications, always with a creative edge.",
      "third": "Beyond coding, I find inspiration in chess and gaming, which sharpen my strategic thinking and ability to anticipate outcomes. My goal is to design user experiences that captivate and simplify, while collaborating with innovative teams. Whether you're a recruiter seeking a motivated developer or a member of the creative community eager to explore bold ideas, I’m excited to contribute, learn, and grow alongside you.",
      "fourth": "Here's a timeline of what I've been upto"
    },
    "skillsTitle": "My Skills",
    "skillsCategories": [
      { "category": "Design", "skills": ["Figma", "Tailwind CSS"] },
      {
        "category": "Front-end",
        "skills": [
          "React",
          "Next.js",
          "JavaScript",
          "TypeScript",
          "SwiftUI",
          "Android"
        ]
      },
      {
        "category": "Back-end",
        "skills": [
          "Node.js",
          "Express",
          "NestJS",
          "C#",
          "Java",
          "PostgreSQL",
          "REST API",
          "GraphQL"
        ]
      },
      {
        "category": "Other",
        "skills": ["Git & GitHub", "Vercel", "Render", "Docker"]
      }
    ]
  },
  "Experience": {
    "title": "My Experience",
    "items": [
      {
        "title": "Graduated Computer Programming",
        "location": "Ottawa, ON, Canada",
        "description": "I completed a two-year Computer Programming diploma at La Cité Collégiale in April 2025, mastering skills in Python, JavaScript, and full-stack development. During my studies, I built a library management application using React, Next.js, and PostgreSQL.",
        "date": "2023 - 2025"
      },
      {
        "title": "Volunteer Developer",
        "location": "Ottawa, ON, Canada",
        "description": "Since May 2025, I’ve been volunteering as a developer, contributing to projects that enhance my expertise in creating clean, user-friendly interfaces. My work involves React, Tailwind CSS, and Node.js, with a focus on collaborative and innovative solutions.",
        "date": "2025 - present"
      },
      {
        "title": "Full-Stack Developer (Open to Opportunities)",
        "location": "Ottawa, ON, Canada",
        "description": "I’m a passionate full-stack developer skilled in React, Next.js, TypeScript, Tailwind CSS, Prisma, and PostgreSQL. I enjoy crafting intuitive interfaces and am eager to join a dynamic team to build impactful applications. Open to full-time roles.",
        "date": "2025 - present"
      }
    ]
  },
  "Error": {
    "notFoundTitle": "Page not found",
    "notFoundMessage": "The page you are looking for does not exist. Please check the URL or return to the home page.",
    "serverErrorTitle": "Server error",
    "serverErrorMessage": "An unexpected error occurred. Please contact <email>arthur.kamenitchualeu@gmail.com</email> if the problem persists.",
    "backHome": "Back to home",
    "showDetails": "Show technical details",
    "hideDetails": "Hide technical details"
  },
  "social": {
    "ariaLabel": "Follow me on"
  }
}
