{
  "HomePage": {
    "greeting": "Bonjour!",
    "description": "Je suis un ingénieur logiciel passionné par la création de systèmes évolutifs et efficaces. Actuellement, je travaille en tant qu'ingénieur logiciel chez Google."
  },
  "Navigation": {
    "about": "À propos",
    "projects": "Projets",
    "experience": "Expérience",
    "contact": "Contact",
    "switchLanguage": "Changer de langue",
    "scrollToTop": "Faites défiler en haut",
    "toggleTheme": "Thème de basculement"
  },
  "CV": "Télécharger CV",
  "Confidential": {
    "description": "Tous droits réservés"
  },
  "MobileMenu": {
    "close": "Fermer le menu",
    "open": "Ouvrir le menu"
  },
  "AnimatedRoles": [
    "Programmeur",
    "Développeur Web",
    "Développeur Mobile",
    "Analyste-Programmeur",
    "Technicien Informatique"
  ],
  "Description": {
    "short": "Je suis un développeur full-stack passionné par la création d'applications innovantes et centrées sur l'utilisateur pour les plateformes web, mobile et desktop, combinant expertise technique avec une conception créative.",
    "details": "Je suis un diplômé de La Cité Collégiale en programmation informatique (2023-2025), spécialisé dans le développement full-stack pour les applications web, mobile et desktop. Je suis passionné par la création de solutions fluides, efficaces et modernes qui améliorent l'expérience utilisateur."
  },
  "ViewMyProjects": "Voir mes projets",
  "ContactMe": {
    "title": "Contactez-moi",
    "description": "Veuillez me contacter directement à arthur.kamenitchualeu@gmail.com ou via ce formulaire.",
    "name": "Votre Nom",
    "email": "Votre Email",
    "message": "Votre Message",
    "send": "Envoyer",
    "success": "Email envoyé avec succès !",
    "error": "Email envoyé échoué !"
  },
  "Projects": {
    "title": "J'ai construit <lot>beaucoup de choses</lot>",
    "description": "Explorez les fruits de mon travail, des petites expériences aux applications web, mobile et desktop, chaque projet met en valeur mon amour pour le code et la conception.",
    "universityLmsDesc": "Un système de gestion de bibliothèque universitaire permettant aux étudiants d’emprunter et de rendre des livres, et aux bibliothécaires de gérer la bibliothèque.",
    "coopBotDesc": "Un bot qui permet aux étudiants d’obtenir des informations sur le mode coop du Collège La Cité.",
    "desktopLmsDesc": "Application bureau pour la gestion d’une bibliothèque : gestion des livres, des membres, des prêts/retours et génération de rapports."
  },
  "RecentProjects": "Projets récents",
  "AboutMe": "À propos de moi",
  "SendDirectEmail": "Veuillez me contacter directement à <email>arthur.kamenitchualeu@gmail.com</email> ou via ce formulaire.",
  "About": {
    "title": "Hey! Je suis <name>Arthur Kameni</name> et je suis un développeur full stack junior.",
    "description": {
      "first": "Je m'appelle Arthur Kameni, un développeur passionné qui a récemment complété sa formation en programmation informatique au Collège La Cité à Ottawa, le 20 avril 2025. Guidé par la patience et la persévérance, je m'épanouis dans la création d'interfaces web épurées et attrayantes qui allient esthétique et fonctionnalité. Mon mantra ? \"Une fois la solution à un problème trouvée, elle devient une évidence.\" Cette philosophie m'inspire à transformer des défis complexes en solutions intuitives, que ce soit pour des applications web, mobiles ou desktop, toujours avec une touche de créativité.",
      "third": "En dehors du code, je trouve mon équilibre dans les échecs et le gaming, des passions qui affûtent ma réflexion stratégique et ma capacité à anticiper. Mon objectif est de concevoir des expériences utilisateur qui captivent et simplifient la vie des utilisateurs, tout en collaborant avec des équipes innovantes. Que vous soyez un recruteur à la recherche d’un développeur motivé ou un membre de la communauté créative souhaitant explorer des idées audacieuses, je suis enthousiaste à l’idée de contribuer et d’apprendre à vos côtés.",
      "fourth": "Voici un timeline de ce que j'ai fait"
    },
    "skillsTitle": "Mes Compétences",
    "skillsCategories": [
      { "category": "Design", "skills": ["Figma", "Tailwind CSS"] },
      {
        "category": "Front-end",
        "skills": [
          "React",
          "Next.js",
          "JavaScript",
          "TypeScript",
          "SwiftUI",
          "Android"
        ]
      },
      {
        "category": "Back-end",
        "skills": [
          "Node.js",
          "Express",
          "NestJS",
          "C#",
          "Java",
          "PostgreSQL",
          "API REST",
          "GraphQL"
        ]
      },
      {
        "category": "Autres",
        "skills": ["Git & GitHub", "Vercel", "Render", "Docker"]
      }
    ]
  },
  "Experience": {
    "title": "Mon expérience",
    "items": [
      {
        "title": "Diplômé en programmation informatique",
        "location": "Ottawa, ON, Canada",
        "description": "J'ai obtenu un diplôme de deux ans en programmation informatique à La Cité Collégiale en avril 2025, maîtrisant Python, JavaScript et le développement full-stack. Durant mes études, j'ai réalisé une application de gestion de bibliothèque avec React, Next.js et PostgreSQL.",
        "date": "2023 - 2025"
      },
      {
        "title": "Développeur bénévole",
        "location": "Ottawa, ON, Canada",
        "description": "Depuis mai 2025, je fais du bénévolat en tant que développeur, contribuant à des projets qui renforcent mon expertise en interfaces propres et intuitives. J'utilise React, Tailwind CSS et Node.js, avec un accent sur la collaboration et l'innovation.",
        "date": "2025 - présent"
      },
      {
        "title": "Développeur Full-Stack (Ouvert aux opportunités)",
        "location": "Ottawa, ON, Canada",
        "description": "Développeur full-stack passionné, compétent en React, Next.js, TypeScript, Tailwind CSS, Prisma et PostgreSQL. J'aime concevoir des interfaces intuitives et souhaite rejoindre une équipe dynamique pour créer des applications à impact. Ouvert aux postes à temps plein.",
        "date": "2025 - présent"
      }
    ]
  },
  "Error": {
    "notFoundTitle": "Page non trouvée",
    "notFoundMessage": "La page que vous cherchez n'existe pas. Veuillez vérifier l'URL ou retourner à la page d'accueil.",
    "serverErrorTitle": "Erreur du serveur",
    "serverErrorMessage": "Une erreur inattendue est survenue. Veuillez contacter <email>arthur.kamenitchualeu@gmail.com</email> si le problème persiste.",
    "backHome": "Retour à l'accueil",
    "showDetails": "Afficher les détails techniques",
    "hideDetails": "Masquer les détails techniques"
  },
  "social": {
    "ariaLabel": "Suivez-moi sur"
  }
}
